import pygame


class settings:
    def __init__(self):
        self.width = 650 # 游戏窗口的宽度
        self.height = 650  # 游戏窗口的高度
        self.color = (251, 248, 239)  # 游戏窗口的颜色
        self.caption = "2048"  # 游戏窗口的标题
        self.block_gap = 10  # 每个方块之间的间距
        self.block_size = 100
        self.block_color = {0: (205, 193, 180),
                            2: (238, 228, 218),
                            4: (237, 224, 200),
                            8: (242, 177, 121),
                            16: (245, 149, 99),
                            32: (246, 124, 95),
                            64: (246, 94, 59),
                            128: (237, 207, 114),
                            256: (237, 204, 97),
                            512: (237, 200, 80),
                            1024: (237, 197, 63),
                            2048: (237, 194, 46)}
        self.square = pygame.Rect(100, 150, 450, 450)  # (100,150)是正方形位置，450，450是正方形的长和宽
        self.square_color = (187, 173, 160) # 正方形的颜色
